{
    "version": "https://jsonfeed.org/version/1",
    "title": "Isekai Legends Whitepaper",
    "description": "",
    "home_page_url": "https://docs.isekailegends.com",
    "feed_url": "https://docs.isekailegends.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Isekai Dev"
    },
    "items": [
        {
            "id": "https://docs.isekailegends.com/isekai-legends-documentation.html",
            "url": "https://docs.isekailegends.com/isekai-legends-documentation.html",
            "title": "Isekai Legends Documentation",
            "summary": "Introduction Welcome to the Isekai Legends documentation! This guide will provide you with an overview of the project, including its&hellip;",
            "content_html": "<h2 id=\"introduction\">Introduction</h2>\n<p>Welcome to the <strong>Isekai Legends</strong> documentation! This guide will provide you with an overview of the project, including its tokenomics, waifus, adventurers’ guilds, reward distribution mechanisms, and referral system.</p>\n<p>Isekai Legends is a decentralized platform that offers an engaging and rewarding experience for users who love anime and NFTs. In Isekai Legends, players can visit the <strong>Sanctum of Legends</strong> to mint powerful and rare unique waifus or explore the <strong>Garden of Seasons</strong> to discover enchanting seasonal waifus through a gacha-like experience. These waifus can be combined into formidable parties at the <strong>Arcane Party Assembler</strong>, which creates uniform farmable tokens based on their rarity and power.<br><br>Armed with their newly formed parties, players can join the <strong>Order of Legendaries</strong> and <strong>Seasonal Enclave</strong> guilds to participate in various farming activities and earn rewards in the form of the ERC20 token <strong>$ISEKAI</strong>. The Order of Legendaries caters to unique waifu parties, granting <em>perpetual rewards</em>, while the Seasonal Enclave offers <em>seasonal rewards</em> for seasonal waifu parties.</p>\n<p>Every season ushers <span class=\"hljs-keyword\">in</span> a <span class=\"hljs-built_in\">new</span> era <span class=\"hljs-keyword\">of</span> farming rewards <span class=\"hljs-keyword\">with</span> an assortment <span class=\"hljs-keyword\">of</span> farmable Seasonal Waifus. <span class=\"hljs-keyword\">Each</span> season offers fresh <span class=\"hljs-built_in\">and</span> captivating art, engaging lore, <span class=\"hljs-built_in\">and</span> powerful abilities <span class=\"hljs-keyword\">for</span> the Waifus, providing players <span class=\"hljs-keyword\">with</span> an evolving <span class=\"hljs-built_in\">and</span> immersive experience. <em>The seasonal nature <span class=\"hljs-keyword\">of</span> the protocol keeps it dynamic <span class=\"hljs-built_in\">and</span> exciting</em>, <span class=\"hljs-keyword\">as</span> players eagerly anticipate the unique opportunities <span class=\"hljs-built_in\">and</span> challenges that come <span class=\"hljs-keyword\">with</span> <span class=\"hljs-keyword\">each</span> <span class=\"hljs-built_in\">new</span> season.</p>\n<p>Get ready to embark on a thrilling journey into the world of Isekai Legends!</p>\n<hr>\n<h2 id=\"tokenomics\">Tokenomics</h2>\n<p class=\"msg msg--highlight \"><span style=\"color: #ffffff;\"><strong>    100% (69T) allocated for liquidity<br><br></strong></span><span style=\"color: #ffffff;\"><strong>     0% dev allocation</strong></span></p>\n<p>The Isekai token ($ISEKAI) serves as the core currency in the Isekai Legends ecosystem.</p>\n<div style=\"margin-left: 2em;\">\n<h3>Funding Protocol Development</h3>\n<p>A small percentage (1%) of the tax collected from $ISEKAI token transactions is allocated to fund the ongoing development of the Isekai Legends protocol. This ensures that the dApp continues to evolve.</p>\n<h3><strong>Autobuy Isekai Token with Mint Proceeds</strong></h3>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">To maintain a sustainable reward system, the mint proceeds from the Isekai ecosystem are programmatically set to autobuy $ISEKAI tokens. These tokens are then used to fund the next round of rewards for the Order of Legendaries and Seasonal Enclave guilds, creating a robust and self-sustaining economy within the Isekai Legends ecosystem.</span></p>\n<p>By integrating the Isekai token into various aspects of the dApp, Isekai Legends ensures that its currency plays a pivotal role in facilitating player engagement and supporting the overall growth of the platform.</p>\n<h3 id=\"tax-mechanism\">Tax Mechanism</h3>\n<p>A adjustable tax mechanism is in place for $ISEKAI token transactions, with the exception of sells to our QuickSwap LP. This tax is utilized to fund the farming rewards for each season, ensuring a continuous flow of rewards. The <em>$ISEKAI tax is 10%</em> at protocol launch. This tax is combined with the mint proceeds from the previous season to fund the next season of rewards.</p>\n<h3 id=\"token-utilities\">Token Utilities</h3>\n<p>$ISEKAI tokens have multiple utilities within the platform:</p>\n<ul>\n<li><strong>Staking:</strong> Users can stake their waifus’ power levels (ERC1155 tokens) in the Adventurers’ Guilds to earn $ISEKAI tokens as rewards.</li>\n<li><strong>Referral Rewards:</strong> Users who refer others to mint Seasonal Waifus can earn a <em>5% kickback</em> in $ISEKAI tokens.</li>\n</ul>\n<h3 id=\"planned-utilities\">Planned Utilities</h3>\n<p>See roadmap for complete overview of planned development.</p>\n<ul>\n<li><strong>Minting:</strong> In future seasons, users will be able mint Seasonal Waifus using $ISEKAI tokens directly once the initial volatility subsides.</li>\n</ul>\n<p>By offering multiple utilities and a capped supply, the $ISEKAI token is designed to provide long-term value and utility within the Isekai Legends ecosystem.</p>\n</div>\n<hr>\n<h2 id=\"waifus\">Waifus</h2>\n<p>In Isekai Legends, Waifus are the central characters that players collect, treasure, and utilize for various in-game activities. Waifus are divided into two main categories: Unique Waifus and Seasonal Waifus. Each category offers distinct features and rarities that cater to different preferences and play styles. Before staking, Waifus must be wrapped into a party, forming their combined “<strong>Party Power Levels</strong>.”</p>\n<div style=\"margin-left: 2em;\">\n<h3 id=\"unique-waifus\">Sanctum of Legends</h3>\n<p><strong>Unique Waifus</strong> are rare and highly sought-after characters with a limited supply. They boast a strong collectible value and are prized possessions among players. Unique Waifus are available in two rarities, each with their own farming power multiplier:</p>\n<ul>\n<li><strong>Epic:</strong> Exceptionally powerful and rare characters with a 1500x farming power multiplier.</li>\n<li><strong>Legendary:</strong> The pinnacle of rarity and power in the Isekai Legends universe with a 3000x farming power multiplier.</li>\n</ul>\n<p class=\"msg msg--highlight \">As the Isekai Legends universe expands, new Unique Waifus will be periodically introduced to the <strong>Sanctum of Legends</strong>. These releases offer players the chance to discover and collect new, exclusive waifus with unique abilities and designs, adding to the excitement and sense of discovery within.</p>\n<h3 id=\"seasonal-waifus\">Garden of Seasons</h3>\n<p>The Garden of Seasons is a special area within the Isekai Legends universe where players can mint Seasonal Waifus. These waifus are a rotating collection of captivating characters with unique abilities, artwork, and stories. Each season brings a fresh array of waifus, offering players the excitement of discovering and collecting new and exclusive characters. Limited-Time Availability Seasonal Waifus are only available for a predetermined period, which corresponds to the duration of each season. Once a season ends, the associated waifus become unattainable, making them highly collectible and valuable to players who managed to obtain them during the season.</p>\n<p class=\"msg msg--highlight \">The price for minting Seasonal Waifus is 10 MATIC, which may change in subsequent seasons. Seasonal Waifus may also be minted for 1 CRYSTAL.</p>\n<p>Seasonal Waifus offer a variety of rarities, allowing players to collect and treasure a diverse range of characters. Each rarity has its own farming power multiplier:</p>\n<ul>\n<li><strong>Common:</strong> 1x farming power multiplier.</li>\n<li><strong>Uncommon:</strong> 5x farming power multiplier.</li>\n<li><strong>Rare:</strong> 20x farming power multiplier.</li>\n<li><strong>Epic:</strong> 100x farming power multiplier.</li>\n<li><strong>Legendary:</strong> 1500x farming power multiplier.</li>\n</ul>\n<p>The higher the rarity of a Seasonal Waifu, the greater the farming power multiplier, allowing players to earn more rewards when staking them in the Seasonal Enclave Adventurers’ Guild.</p>\n</div>\n<hr>\n<h2 id=\"forming-party\">Forming a Party - Arcane Party Assembler</h2>\n<p>In the world of Isekai Legends, the <strong>Arcane Party Assembler</strong> plays a crucial role in uniting adventurers and their waifus for exciting quests and thrilling battles. This mystical process allows players to transform their Unique and Seasonal Waifus into <strong>wrapped waifus</strong>, called <strong>Power Level</strong> facilitating a more streamlined and efficient distribution of rewards across different rarities and multipliers.</p>\n<div style=\"margin-left: 2em;\">\n<h3>Harnessing the Power of Arcane Magic</h3>\n<p>Through the use of ancient arcane magic, the Arcane Party Assembler converts Unique and Seasonal Waifus separately into wrapped waifus, imbuing them with a unified energy form. This mystical transformation allows for a more balanced distribution of rewards, taking into account the various rarities and multipliers of the waifus.</p>\n<h3>Party Power Level</h3>\n<p>The number of wrapped waifus obtained from the Arcane Party Assembler reflects their rarity multiplier and establishes the power level of each party. For instance, a party with 3000 wrapped waifu tokens possesses a power level of 3000. This power level acts as a gauge of a party's prowess and potential within the Isekai Legends universe.</p>\n<h3>Embarking on Exciting Adventures</h3>\n<p>By utilizing the Arcane Party Assembler, players can prepare their waifu collection for the thrilling quests and challenges that lie ahead. As they explore the enchanting world of Isekai Legends, their parties of wrapped waifus stand ready to face epic battles, overcome obstacles, and earn valuable rewards.</p>\n<h3>Future Potential for Expired Parties</h3>\n<p>The Arcane Party Assembler also holds the promise of future functionality for parties that have completed their seasonal adventures. These expired parties may unlock special benefits, such as:</p>\n<ul>\n<li>Exclusive NFT collectibles representing their past achievements and adventures.</li>\n<li>Eligibility for bounties, granting players access to unique in-game content or additional rewards.</li>\n<li>Entry into a lottery, providing a chance to win rare waifus or other valuable prizes.</li>\n</ul>\n<p>While the specifics of these features are still in development, they aim to enhance the Isekai Legends experience and reward players for their continued dedication and engagement.</p>\n<p>The Arcane Party Assembler provides an essential tool for players as they navigate the vast world of Isekai Legends, ensuring a smooth and engaging experience for every adventurer. The arcane magic that powers the Assembler not only streamlines reward distribution but also adds a touch of mystical allure to the overall journey.</p>\n</div>\n<hr>\n<h2 id=\"adventurers-guilds\">Adventurers’ Guilds</h2>\n<p>Isekai Legends features two distinguished Adventurers’ Guilds that players can join to stake their wrapped Waifu parties’ Party Power Levels and earn $ISEKAI tokens as rewards. Staking your Party Power Levels into the guilds is akin to “sending your Waifus on an adventure.” The guilds cater to the different Waifu categories, providing a tailored experience for players based on their collections.</p>\n<div style=\"margin-left: 2em;\">\n<h3 id=\"order-of-legendaries\">Order of Legendaries</h3>\n<p>The Order of Legendaries is an esteemed society that caters exclusively to players who hold Unique Waifus. By staking their Party Power Levels comprised of Unique Waifus, players gain access to a prestigious and rewarding experience. The Order of Legendaries receives a portion of the protocol income, which is allocated to reward its members.</p>\n<h3 id=\"seasonal-enclave\">Seasonal Enclave</h3>\n<p>The Seasonal Enclave is a vibrant and ever-changing community tailored for players with Seasonal Waifus. As players stake their Party Power Levels comprised of Seasonal Waifus, they can earn a share of the protocol income allocated for the Seasonal Enclave. The Enclave offers a dynamic and engaging experience, with rewards and opportunities evolving with each season.</p>\n</div>\n<hr>\n<h2>The Crystals Token</h2>\n<p>The Crystals token is a special utility token exclusive to the Isekai Legends ecosystem, designed specifically for rewarding Liquidity Providers (LPs). Crystals are <strong>untradable and untransferable</strong>, ensuring that their value is tied directly to the Isekai Legends platform.</p>\n<div style=\"margin-left: 2em;\">\n<h3>Rewarding LP Farmers</h3>\n<p>The <strong>Crystal Treasure Finder</strong> is a unique mechanism that allows players to stake their LP tokens and earn rewards in the form of <strong>Crystals</strong>. These rewards are minted by the LP rewarder, creating an incentive for players to contribute liquidity to the platform.</p>\n<h3>Spending Crystals on Seasonal Waifus</h3>\n<p>Crystals can only be spent on minting seasonal waifus at the Garden of Seasons. Players who use Crystals to mint seasonal waifus will enjoy <strong>better rarity drop rates</strong> compared to those who mint using MATIC. This advantage encourages participation in the LP farming system and creates a more vibrant ecosystem within Isekai Legends.</p>\n<p class=\"msg msg--highlight\"><strong>$CRYSTALS do not drop COMMON waifus, only UNCOMMON and above!<br><br>However,<br><br>$CRYSTALS cannot be exchanged, transfered, sold, nor bought. They are minted by the LP farm and burned when minting Isekai NFTs.</strong></p>\n<h3>Crystals Decay Mechanism</h3>\n<p>In the mystical world of Isekai Legends, Crystals possess a unique property that <em>causes them to decay over time</em>. At the end of each season, the Crystals' potency diminishes by a factor of 1/2 (one half), representing their ephemeral nature.<br><br>This decay mechanism encourages players to spend their Crystals on seasonal waifus during the current season rather than hoarding them for future seasons. Although players are free to accumulate Crystals, they will find it more advantageous to utilize them within the same season they are earned.</p>\n</div>\n<h2 id=\"contract-addresses\">Contract Addresses</h2>\n<p>$ISEKAI<br><code style=\"font-weight: var(--font-weight-normal);\">0x449460B019eC80787660E665AAe42b920A33764F</code><br>SushiSwap LP<br><code style=\"font-weight: var(--font-weight-normal);\">0x449460B019eC80787660E665AAe42b920A33764F</code></p>",
            "author": {
                "name": "Isekai Dev"
            },
            "tags": [
            ],
            "date_published": "2023-04-12T04:52:27-03:00",
            "date_modified": "2023-04-12T23:15:29-03:00"
        }
    ]
}
