{
    "version": "https://jsonfeed.org/version/1",
    "title": "Isekai Legends Whitepaper",
    "description": "",
    "home_page_url": "https://docs.isekailegends.com",
    "feed_url": "https://docs.isekailegends.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Isekai Dev"
    },
    "items": [
        {
            "id": "https://docs.isekailegends.com/isekai-legends-documention.html",
            "url": "https://docs.isekailegends.com/isekai-legends-documention.html",
            "title": "Isekai Legends Documention",
            "summary": "Introduction Welcome to the Isekai Legends documentation! This guide will provide you with an overview of the project, including its&hellip;",
            "content_html": "<h1 id=\"introduction\">Introduction</h1>\n<p>Welcome to the Isekai Legends documentation! This guide will provide you with an overview of the project, including its tokenomics, waifus, adventurers’ guilds, reward distribution mechanisms, and referral system. You’ll also find information on the ERC1155 staking contract (<em>Adventure Party</em>) that powers the Isekai Legends platform.</p>\n<p>Isekai Legends is a decentralized platform that offers an engaging and rewarding experience for users who love anime and NFTs. The platform features two types of waifus (Unique and Seasonal) that users can collect and use to participate in various activities, such as staking their waifus’ power levels to earn $ISEKAI tokens in the Adventurers’ Guilds.</p>\n<p>Get ready to embark on a thrilling journey into the world of Isekai Legends!</p>\n<h1 id=\"tokenomics\">Tokenomics</h1>\n<h5 id=\"100-69t-allocated-for-liquidity\">100% (69T) allocated for liquidity</h5>\n<h5 id=\"0-dev-allocation\">0% dev allocation</h5>\n<p>The Isekai token ($ISEKAI) serves as the core currency in the Isekai Legends ecosystem.</p>\n<p><strong>Funding Protocol Development</strong></p>\n<p>A small percentage (1%) of the tax collected from $ISEKAI token transactions is allocated to fund the ongoing development of the Isekai Legends protocol. This ensures that the dApp continues to evolve.</p>\n<p><strong>Autobuy Isekai Token with Mint Proceeds</strong></p>\n<p>To maintain a sustainable reward system, the mint proceeds from both unique and seasonal waifus are programmatically set to autobuy $ISEKAI tokens. These tokens are then used to fund the next round of rewards for the Order of Legendaries and Seasonal Enclave guilds, creating a robust and self-sustaining economy within the Isekai Legends ecosystem.</p>\n<p>By integrating the Isekai token into various aspects of the dApp, Isekai Legends ensures that its in-game currency plays a pivotal role in facilitating player engagement and supporting the overall growth of the platform.</p>\n<h2 id=\"tax-mechanism\">Tax Mechanism</h2>\n<p>A adjustable tax mechanism is in place for $ISEKAI token transactions, with the exception of sells to our QuickSwap LP. This tax is utilized to fund the farming rewards for each season, ensuring a continuous flow of rewards. The <em>$ISEKAI tax is 10%</em> at protocol launch. This tax is combined with the mint proceeds from the previous season to fund the next season of rewards.</p>\n<h2 id=\"token-utilities\">Token Utilities</h2>\n<p>$ISEKAI tokens have multiple utilities within the platform:</p>\n<ul>\n<li><strong>Staking:</strong> Users can stake their waifus’ power levels (ERC1155 tokens) in the Adventurers’ Guilds to earn $ISEKAI tokens as rewards.</li>\n<li><strong>Referral Rewards:</strong> Users who refer others to mint Seasonal Waifus can earn a <em>5% kickback</em> in $ISEKAI tokens.</li>\n</ul>\n<h2 id=\"planned-utilities\">Planned Utilities</h2>\n<ul>\n<li><strong>Minting:</strong> In future seasons, users will be able mint Seasonal Waifus using $ISEKAI tokens directly once the initial volatility subsides.</li>\n</ul>\n<p>By offering multiple utilities and a capped supply, the $ISEKAI token is designed to provide long-term value and utility within the Isekai Legends ecosystem.</p>\n<h1 id=\"waifus\">Waifus</h1>\n<p>In Isekai Legends, Waifus are the collectible NFTs representing characters that players can obtain and manage. There are two types of Waifus: Unique Waifus and Seasonal Waifus. Each type of Waifu has its own characteristics and functions within the ecosystem.</p>\n<h2 id=\"unique-waifus\">Unique Waifus</h2>\n<p>Unique Waifus are rare and limited in supply, giving them higher collectible value. These Waifus are designed with special attributes and can be staked in the Order of Legendaries Adventurers’ Guild to earn a portion of the protocol income as rewards. Unique Waifus can only be obtained through limited public mints, special events or challenges. The supply at protocol genesis is capped at 20 Unique Waifus but more may be released over time. </p>\n<p>Unique Waifus have a higher farming power compared to Seasonal Waifus due to their rarity. They possess a farming power multiplier of 1,500x for Epic Waifus and 3,000x for Legendary Waifus. This increased farming power allows players who own Unique Waifus to earn more rewards when staking them in the Order of Legendaries Adventurers’ Guild.</p>\n<h2 id=\"seasonal-waifus\">Seasonal Waifus</h2>\n<p>Seasonal Waifus are minted during specific seasons and are part of a gacha-style mystery box system. Players can mint Seasonal Waifus using $MATIC currency, and is planned to switch to $ISEKAI in further seasons. Seasonal Waifus can be staked in the Seasonal Enclave Adventurers’ Guild to earn a portion of the protocol income as rewards.</p>\n<p>Seasonal Waifus have different farming power multipliers based on their rarity:</p>\n<ul>\n<li><strong>Common:</strong> 1x farming power</li>\n<li><strong>Uncommon:</strong> 5x farming power</li>\n<li><strong>Rare:</strong> 20x farming power</li>\n<li><strong>Epic:</strong> 100x farming power</li>\n<li><strong>Legendary:</strong> 1,500x farming power</li>\n</ul>\n<p>The higher the rarity of a Seasonal Waifu, the greater the farming power multiplier, allowing players to earn more rewards when staking them in the Seasonal Enclave Adventurers’ Guild.</p>\n",
            "author": {
                "name": "Isekai Dev"
            },
            "tags": [
            ],
            "date_published": "2023-04-06T11:29:24-03:00",
            "date_modified": "2023-04-11T17:52:10-03:00"
        }
    ]
}
