{
    "version": "https://jsonfeed.org/version/1",
    "title": "Isekai Legends Whitepaper",
    "description": "",
    "home_page_url": "https://docs.isekailegends.com",
    "feed_url": "https://docs.isekailegends.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Isekai Dev"
    },
    "items": [
        {
            "id": "https://docs.isekailegends.com/isekai-legends-documention.html",
            "url": "https://docs.isekailegends.com/isekai-legends-documention.html",
            "title": "Isekai Legends Documention",
            "summary": "Table of Contents Introduction Tokenomics $ISEKAI Token Protocol Income Waifus Unique Waifus Seasonal Waifus Adventurers’ Guilds Order of Legendaries Seasonal&hellip;",
            "content_html": "<h1 id=\"table-of-contents\">Table of Contents</h1>\n<ol>\n<li><a href=\"#introduction\">Introduction</a></li>\n<li><a href=\"#tokenomics\">Tokenomics</a><ol>\n<li><a href=\"#isekai-token\">$ISEKAI Token</a></li>\n<li><a href=\"#protocol-income\">Protocol Income</a></li>\n</ol>\n</li>\n<li><a href=\"#waifus\">Waifus</a><ol>\n<li><a href=\"#unique-waifus\">Unique Waifus</a></li>\n<li><a href=\"#seasonal-waifus\">Seasonal Waifus</a></li>\n</ol>\n</li>\n<li><a href=\"#adventurers-guilds\">Adventurers’ Guilds</a><ol>\n<li><a href=\"#order-of-legendaries\">Order of Legendaries</a></li>\n<li><a href=\"#seasonal-enclave\">Seasonal Enclave</a></li>\n</ol>\n</li>\n<li><a href=\"#reward-distribution-mechanism\">Reward Distribution Mechanism</a></li>\n<li><a href=\"#referral-system\">Referral System</a></li>\n<li><a href=\"#smart-contract-documentation\">Smart Contract Documentation</a><ol>\n<li><a href=\"#erc1155-staking-contract\">ERC1155 Staking Contract</a></li>\n</ol>\n</li>\n</ol>\n<h1 id=\"1-introduction\">1. Introduction</h1>\n<p>Welcome to the Isekai Legends documentation! This guide will provide you with an overview of the project, including its tokenomics, waifus, adventurers’ guilds, reward distribution mechanisms, and referral system. You’ll also find information on the ERC1155 staking contract (<em>Adventure Party</em>) that powers the Isekai Legends platform.</p>\n<p>Isekai Legends is a decentralized platform that offers an engaging and rewarding experience for users who love anime and NFTs. The platform features two types of waifus (Unique and Seasonal) that users can collect and use to participate in various activities, such as staking their waifus’ power levels to earn $ISEKAI tokens in the Adventurers’ Guilds.</p>\n<p>Get ready to embark on a thrilling journey into the world of Isekai Legends!</p>\n<h1 id=\"2-tokenomics\">2. Tokenomics</h1>\n<h5 id=\"100-69t-allocated-for-liquidity\">100% (69T) allocated for liquidity</h5>\n<h5 id=\"0-dev-allocation\">0% dev allocation</h5>\n<p>The Isekai token ($ISEKAI) serves as the core currency in the Isekai Legends ecosystem.</p>\n<p><strong>Funding Protocol Development</strong></p>\n<p>A small percentage (1%) of the tax collected from $ISEKAI token transactions is allocated to fund the ongoing development of the Isekai Legends protocol. This ensures that the dApp continues to evolve.</p>\n<p><strong>Autobuy Isekai Token with Mint Proceeds</strong></p>\n<p>To maintain a sustainable reward system, the mint proceeds from both unique and seasonal waifus are programmatically set to autobuy $ISEKAI tokens. These tokens are then used to fund the next round of rewards for the Order of Legendaries and Seasonal Enclave guilds, creating a robust and self-sustaining economy within the Isekai Legends ecosystem.</p>\n<p>By integrating the Isekai token into various aspects of the dApp, Isekai Legends ensures that its in-game currency plays a pivotal role in facilitating player engagement and supporting the overall growth of the platform.</p>\n<h2 id=\"tax-mechanism\">Tax Mechanism</h2>\n<p>A adjustable tax mechanism is in place for $ISEKAI token transactions, with the exception of EOA (Externally Owned Account) to EOA transfers. This allows users to transfer funds to their cold wallets without being penalized for doing so. This tax is utilized to fund the farming rewards for each season, ensuring a continuous flow of rewards. The <em>$ISEKAI tax is 10%</em> at protocol launch. 99% of this tax is combined with the mint proceeds from the previous season to fund the next season of rewards.</p>\n<h2 id=\"token-utilities\">Token Utilities</h2>\n<p>$ISEKAI tokens have multiple utilities within the platform:</p>\n<ul>\n<li><strong>Staking:</strong> Users can stake their waifus’ power levels (ERC1155 tokens) in the Adventurers’ Guilds to earn $ISEKAI tokens as rewards.</li>\n<li><strong>Referral Rewards:</strong> Users who refer others to mint Seasonal Waifus can earn a <em>5% kickback</em> in $ISEKAI tokens.</li>\n</ul>\n<h2 id=\"planned-utilities\">Planned Utilities</h2>\n<ul>\n<li><strong>Minting:</strong> In future seasons, users will be able mint Seasonal Waifus using $ISEKAI tokens directly once the initial volatility subsides.</li>\n</ul>\n<p>By offering multiple utilities and a capped supply, the $ISEKAI token is designed to provide long-term value and utility within the Isekai Legends ecosystem.</p>\n",
            "author": {
                "name": "Isekai Dev"
            },
            "tags": [
            ],
            "date_published": "2023-04-06T11:29:24-03:00",
            "date_modified": "2023-04-06T20:59:04-03:00"
        }
    ]
}
